const fakeInformations = [
    {
      title:"โครงการอบรมการใช้งานลิขสิทธิ์ที่เป็นธรรม",
      date: "12/5/2567",
      info: "งานทรัพย์สินทางปัญญา กองกิจการพิเศษ จัดโครงการอบรมการใช้งานลิขสิทธิ์ที่เป็นธรรม...",
      image: "/Information1.png"
    },
    {
      title:"โครงการอบรมเรื่องสิทธิ์ของผู้สร้างสรรค์ในงานอันมีลิขสิทธิ์",
      date: "10/7/2567",
      info: "งานทรัพย์สินทางปัญญา (TLO) มหาวิทยาลัยราชภัฏนครราชสีมา จัดโครงการอบรมรื่อง สิทธิ์ของผู้สร้างสรรค์ในงานอันมีลิขสิทธิ์...",
      image: "/Information2.png"
    }
  ]

export default fakeInformations