export const fakePieChart = {
    labels: [
      "คณะพยาบาลศาสตร์",
      "คณะมนุษย์ศาสตร์และสังคมศาสตร์",
      "บุคคลภายนอก",
      "คณะวิทยาการจัดการ",
      "คณะครุศาสตร์",
      "คณะวิทยาศาสตร์",
      "บัณฑิตวิทยาลัย",
      "คณะสาธารณสุขศาสตร์",
      "คณะเทคโนโลยีสารสนเทศ",
    ],
    datasets: [
      {
        label: "",
        data: [9.6, 17.3, 23.1, 15.4, 11.5, 5.8, 7.7, 3.8, 4.8],
        backgroundColor: [
          "rgba(70, 95, 229, 1)",
          "rgba(229, 238, 249, 1)",
          "rgba(189, 211, 244, 1)",
          "rgba(150, 175, 239, 1)",
          "rgba(110, 130, 234, 1)",
          "rgba(65, 70, 196, 1)",
          "rgba(60, 89, 163, 1)",
          "rgba(56, 68, 129, 1)",
          "rgba(51, 53, 96, 1)",
        ],
        borderWidth: 0,
      },
    ],
  };

  export const fakeBarChart = {
    labels: [
      "สิทธิบัตรการออกแบบผลิตภัณฑ์",
      "ลิขสิทธิ์",
      "สิทธิบัตรการประดิษฐ์และอนุสิทธิบัตร",
      "เครื่องหมายการค้า",
    ],
    datasets: [
      {
        label: "",
        data: [15,6,20,15,14],
        backgroundColor: [
          "rgba(70, 95, 229, 1)",
          "rgba(229, 238, 249, 1)",
          "rgba(189, 211, 244, 1)",
          "rgba(150, 175, 239, 1)",
        ],
        borderWidth: 0,
      },
    ],
  };