export type PartnerStatus =
  | "บุคคลธรรมดา"
  | "นิติบุคคล"
  | "หน่วยงานรัฐ"
  | "มูลนิธิ"
  | "อื่น ๆ";
export const partnerStatus = [
  "บุคคลธรรมดา",
  "นิติบุคคล",
  "หน่วยงานรัฐ",
  "มูลนิธิ",
  "อื่น ๆ",
];

export const menuBenefits = [
  {
    title: "ตัวผลิตภัณฑ์",
  },
  {
    title: "กรรมวิธีการผลิต",
  },
  {
    title: "ระบบการทำงาน",
  },
  {
    title: "โครงสร้างของเครื่อง",
  },
  {
    title: "โปรแกรมคอมพิวเตอร์",
  },
  {
    title: "องค์ความรู้",
  },
  {
    title: "คู่มือ",
  },
  {
    title: "รูปเล่มรายงานวิจัย",
  },
  {
    title: "สื่อการเรียนการสอน",
  },
  {
    title: "สื่อประชาสัมพันธ์ เช่น โบชัวร์ แผ่นพับ คลิปวิดีโอ",
  },
  {
    title: "สูตร/ส่วนผสมของผลิตภัณฑ์",
  },
] as const;

export type ResearchOwnershipSubmission =
  | "มีการยื่นขอเป็นเจ้าของผลงานวิจัยและนวัตกรรมกับแหล่งทุนแล้ว"
  | "ยังไม่มีการยื่น";
export const researchOwnershipSubmissionList = [
  "มีการยื่นขอเป็นเจ้าของผลงานวิจัยและนวัตกรรมกับแหล่งทุนแล้ว",
  "ยังไม่มีการยื่น",
] as const;

export const websites = [
  {
    title: "ประเทศไทย : www.ipthailand.go.th",
  },
  {
    title: "สหรัฐอเมริกา : www.uspto.gov",
  },
  {
    title: "ญี่ปุ่น : www.jpo.go.jp",
  },
  {
    title: "ยุโรป : www.espacenet.com",
  },
];

export type Websites =
  | "ประเทศไทย : www.ipthailand.go.th"
  | "สหรัฐอเมริกา : www.uspto.gov"
  | "ญี่ปุ่น : www.jpo.go.jp"
  | "ยุโรป : www.espacenet.com";

export type FundingLists =
  | "ไม่ได้รับทุนอุดหนุนใดๆ"
  | "ทุนอุดหนุนงบประมาณแผ่นดิน มหาวิทยาลัยราชภัฏนครราชสีมา"
  | "ทุนอุดหนุนเงินรายได้/กองทุนวิจัย มหาวิทยาลัยราชภัฏนครราชสีมา"
  | "ทุนจากหน่วยงานภายนอก";

export const fundingLists = [
  "ไม่ได้รับทุนอุดหนุนใดๆ",
  "ทุนอุดหนุนงบประมาณแผ่นดิน มหาวิทยาลัยราชภัฏนครราชสีมา",
  "ทุนอุดหนุนเงินรายได้/กองทุนวิจัย มหาวิทยาลัยราชภัฏนครราชสีมา",
  "ทุนจากหน่วยงานภายนอก",
  "อื่น ๆ (โปรดระบุ) ....",
];

export type ResearchType =
  | "มีในระดับห้องทดลอง "
  | "มีในสัตว์ทดลอง"
  | "มีในมนุษย์"
  | "ไม่มี";

export const researchTypes = [
  "มีในระดับห้องทดลอง ",
  "มีในสัตว์ทดลอง",
  "มีในมนุษย์",
  "ไม่มี",
];

export type AgreementTitle = "สัญญาถ่ายโอนวัสดุชีวภาพ" | "อื่นๆ" | "ไม่มี";
export const agreementTitles = [
  "สัญญาถ่ายโอนวัสดุชีวภาพ",
  "อื่นๆ",
  "ไม่มี",
] as const;
export const searchResults = [
  "เหมือนหรือคล้ายกับงานที่ปรากฏอยู่ก่อนแล้ว",
  "ไม่เหมือนหรือคล้ายกับงานที่ปรากฏอยู่ก่อนแล้ว",
];
export type SearchResults =
  | "เหมือนหรือคล้ายกับงานที่ปรากฏอยู่ก่อนแล้ว"
  | "ไม่เหมือนหรือคล้ายกับงานที่ปรากฏอยู่ก่อนแล้ว";

export type PublicType =
  | "รายงานวิจัยฉบับสมบูรณ์"
  | "ตีพิมพ์ในวารสาร (Journal)"
  | "การนำเสนอผลงานในการประชุม/การแสดงสินค้า/การออกบูธประชาสัมพันธ"
  | "การวางจำหน่ายผลงาน"
  | "ตีพิมพ์ในวารสาร (Journal)"
  | "การส่งผลงานตีพิมพ์"
  | "อื่น ๆ (โปรดระบุ)"
  | "ไม่เผยแพร่ผลงาน";
export const publicType = [
  "รายงานวิจัยฉบับสมบูรณ์",
  "ตีพิมพ์ในวารสาร (Journal)",
  "การนำเสนอผลงานในการประชุม/การแสดงสินค้า/การออกบูธประชาสัมพันธ",
  "การวางจำหน่ายผลงาน",
  "การส่งผลงานตีพิมพ์",
];

export const supportBenefits = [
  "การใช้ประโยชน์เชิงวิชาการ",
  "การใช้ประโยชน์เชิงนโยบาย",
  "การใช้ประโยชน์เชิงสาธารณะ",
  "การใช้ประโยชน์เชิงพาณิชย์",
];
