import { title } from "process";

export const menuBenefits = [
  {
    title: "ตัวผลิตภัณฑ์",
  },
  {
    title: "กรรมวิธีการผลิต",
  },
  {
    title: "ระบบการทำงาน",
  },
  {
    title: "โครงสร้างของเครื่อง",
  },
  {
    title: "โปรแกรมคอมพิวเตอร์",
  },
  {
    title: "องค์ความรู้",
  },
  {
    title: "คู่มือ",
  },
  {
    title: "รูปเล่มรายงานวิจัย",
  },
  {
    title: "สื่อการเรียนการสอน",
  },
  {
    title: "สื่อประชาสัมพันธ์ เช่น โบชัวร์ แผ่นพับ คลิปวิดีโอ",
  },
  {
    title: "สูตร/ส่วนผสมของผลิตภัณฑ์",
  },
] as const;

export const websites = [
  {
    title: "ประเทศไทย : www.ipthailand.go.th",
  },
  {
    title: "สหรัฐอเมริกา : www.uspto.gov",
  },
  {
    title: "ญี่ปุ่น : www.jpo.go.jp",
  },
  {
    title: "ยุโรป : www.espacenet.com",
  },
] as const;

export type FundingLists =
  | "ไม่ได้รับทุนอุดหนุนใดๆ"
  | "ทุนอุดหนุนงบประมาณแผ่นดิน มหาวิทยาลัยราชภัฏนครราชสีมา"
  | "ทุนอุดหนุนเงินรายได้/กองทุนวิจัย มหาวิทยาลัยราชภัฏนครราชสีมา"
  | "ทุนจากหน่วยงานภายนอก";

export const fundingLists = [
  "ไม่ได้รับทุนอุดหนุนใดๆ",
  "ทุนอุดหนุนงบประมาณแผ่นดิน มหาวิทยาลัยราชภัฏนครราชสีมา",
  "ทุนอุดหนุนเงินรายได้/กองทุนวิจัย มหาวิทยาลัยราชภัฏนครราชสีมา",
  "ทุนจากหน่วยงานภายนอก",
];

export const researchTypes = [
  {
    title: "มีในระดับห้องทดลอง ",
  },
  {
    title: "มีในสัตว์ทดลอง",
  },
  {
    title: "มีในมนุษย์",
  },
];

export const searchResults = [
  {
    title: "เหมือนหรือคล้ายกับงานที่ปรากฏอยู่ก่อนแล้ว",
  },
  {
    title: "ไม่เหมือนหรือคล้ายกับงานที่ปรากฏอยู่ก่อนแล้ว",
  },
];

export const releaseType = [
  {
    title: "รายงานวิจัยฉบับสมบูรณ์",
  },
  {
    title: "ตีพิมพ์ในวารสาร (Journal)",
  },
  {
    title: "การนำเสนอผลงานในการประชุม/การแสดงสินค้า/การออกบูธประชาสัมพันธ",
  },
  {
    title: "การวางจำหน่ายผลงาน",
  },
  {
    title: "ตีพิมพ์ในวารสาร (Journal)",
  },
  {
    title: "การส่งผลงานตีพิมพ์",
  },
  {
    title: "อื่น ๆ (โปรดระบุ)",
  },
];
