export const menuDesignForm2 = [
    {title: 'ตัวผลิตภัณฑ์'},
    {title: 'กรรมวิธีการผลิต'},
    {title: 'ระบบการทำงาน'},
    {title: 'โครงสร้างของเครื่อง'},
    {title: 'โปรแกรมคอมพิวเตอร์'},
    {title: 'องค์ความรู้'},
    {title: 'คู่มือ'},
    {title: 'รูปเล่มรายงานวิจัย'},
    {title: 'สื่อการเรียนการสอน'},
    {title: 'สื่อประชาสัมพันธ์ เช่น โบชัวร์ แผ่นพับ คลิปวิดีโอ'},
    {title: 'สูตร/ส่วนผสมของผลิตภัณฑ์'}
]

export const menuWebDesign = [
    {title: 'ประเทศไทย : www.ipthailand.go.th'},
    {title: 'สหรัฐอเมริกา : www.uspto.gov'},
    {title: 'ญี่ปุ่น : www.jpo.go.jp'},
    {title: 'ยุโรป : www.espacenet.com'},
]

export const menuNrruDesign3 = [
    {title: 'การใช้ประโยชน์เชิงวิชาการ'},
    {title: 'การใช้ประโยชน์เชิงนโยบาย'},
    {title: 'การใช้ประโยชน์เชิงสาธารณะ'},
    {title: 'การใช้ประโยชน์เชิงพาณิชย์'},
]

export const menuNrruCopyright2 = [
    {title: 'วรรณกรม'},
    {title: 'ภาพยนตร์'},
    {title: 'ดนตรีกรรม'},
    {title: 'โสตทัศนวัสดุ'},
    {title: 'ศิลปกรรม'},
    {title: 'งานแพร่เสียงแพร่ภาพ'},
    {title: 'นาฏกรรม'},
    {title: 'สิ่งบันทึกเสียง'},
    {title: 'งานอื่นใดในแผนกวรรณคดีแผนกวิทยาศาสตร์หรือแผนกศิลปะ'},
]

export const menuNrruCopyright8 = [
    {title: 'หนังสืออักษรเบรลล์'},
    {title: 'สื่อที่มีลักษณะเป็นสื่อผสม'},
    {title: 'สื่อเสียง'},
    {title: 'สื่อภาษามือ'},
    {title: 'สื่อที่มีลักษณะเป็นสื่อผสม'},
    {title: 'คำบรรยายแทนเสียง'},
    {title: 'ตัวหนังสือนูนแผนภาพนูน'},
    {title: 'สื่อการสอนรูปทรงเรขาคณิต'},
    {title: 'รูปจำลอง'},
    {title: 'สื่อเพื่อการเรียนรู้และพัฒนาทักษะ'},
    {title: 'สื่ออิเล็กทรอนิกส์ตามมาตรฐานสากล'},
]

