export const menuTrademark2 = [
  { title: " เครื่องหมายการค้า/บริการ" },
  { title: "เครื่องหมายรับรอง" },
  { title: "เครื่องหมายร่วม" },
];

export const personStatusOptions = [
  "บุคคลธรรมดา",
  "นิติบุคคล",
  "ส่วนราชการไทย",
  "ต่างชาติ",
];

export const OTOPOptions = [
  "ผู้ประกอบการรายเดียว",
  "กลุ่มผู้ประกอบการ",
  "SMEs",
];

export type PersonStatusOptions =
  | "บุคคลธรรมดา"
  | "นิติบุคคล"
  | "ส่วนราชการไทย"
  | "ต่างชาติ";

export type AllowColorProtectionOptions =
  | "ไม่ขอรับความคุ้มครอง"
  | "ขอรับความคุ้มครอง (ให้บรรยายลักษณะกลุ่มของสีและระบุสีให้ชัดเจน )";
export const allowColorProtectionOptions = [
  "ไม่ขอรับความคุ้มครอง",
  "ขอรับความคุ้มครอง (ให้บรรยายลักษณะกลุ่มของสีและระบุสีให้ชัดเจน )",
];

export const allowShapeProtectionOptions = [
  "ไม่ขอรับความคุ้มครอง",
  "ขอรับความคุ้มครอง (ให้แสดงภาพด้านอื่น ๆ ของเครื่องหมายลงในภาพเครื่องหมายข้อ 3 ด้วย)",
];

export const allowMarketingOptions = [
  "ได้ใช้หรืออนุญาตให้ใช้",
  "ไม่เคยใช้หรืออนุญาตให้ใช้",
];

export const allowPublicOptions = [
  "ไม่ขอรับความคุ้มครอง",
  "ขอถือสิทธิและได้ยื่นคําขอพร้อมเอกสารหลักฐาน",
  "ขอถือสิทธิและได้ยื่นหนังสือขอผอนผันการส่งเอกสารหลักฐาน",
];
