export type FacultyLists =
  | "คณะครุศาสตร์"
  | "คณะมนุษยศาสตร์และสังคมศาสตร์"
  | "คณะวิทยาศาสตร์และเทคโนโลยี"
  | "คณะวิทยาการจัดการ"
  | "คณะเทคโนโลยีอุตสาหกรรม"
  | "คณะสาธารณสุขศาสตร์"
  | "คณะพยาบาลศาสตร์"
  | "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏนครราชสีมา"
  | "บัณฑิตวิทยาลัย"
  | "หน่วยตรวจสอบภายใน"
  | "สำนักส่งเสริมวิชาการและงานทะเบียน"
  | "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ"
  | "สถาบันวิจัยและพัฒนา"
  | "สำนักศิลปะและวัฒนธรรม"
  | "สถาบันวิจัยไม้กลายเป็นหินและทรัพยากรธรณี"
  | "สำนักคอมพิวเตอร์"
  | "สถาบันภาษา"
  | "สำนักงานอธิการบดี"
  | "สำนักงานสภามหาวิทยาลัย"
  | "ศูนย์การศึกษาพิเศษ"
  | "ศูนย์วิทยาศาสตร์";

export const FacultyLists: FacultyLists[] = [
  "คณะครุศาสตร์",
  "คณะมนุษยศาสตร์และสังคมศาสตร์",
  "คณะวิทยาศาสตร์และเทคโนโลยี",
  "คณะวิทยาการจัดการ",
  "คณะเทคโนโลยีอุตสาหกรรม",
  "คณะสาธารณสุขศาสตร์",
  "คณะพยาบาลศาสตร์",
  "โรงเรียนสาธิตมหาวิทยาลัยราชภัฏนครราชสีมา",
  "บัณฑิตวิทยาลัย",
  "หน่วยตรวจสอบภายใน",
  "สำนักส่งเสริมวิชาการและงานทะเบียน",
  "สำนักวิทยบริการและเทคโนโลยีสารสนเทศ",
  "สถาบันวิจัยและพัฒนา",
  "สำนักศิลปะและวัฒนธรรม",
  "สถาบันวิจัยไม้กลายเป็นหินและทรัพยากรธรณี",
  "สำนักคอมพิวเตอร์",
  "สถาบันภาษา",
  "สำนักงานอธิการบดี",
  "สำนักงานสภามหาวิทยาลัย",
  "ศูนย์การศึกษาพิเศษ",
  "ศูนย์วิทยาศาสตร์",
];

export type OccupationLists =
  | "ค้าขาย"
  | "ประกอบการค้า"
  | "ผลิตและค้าขาย"
  | "ค้าขายและอุตสาหกรรม"
  | "ประกอบกิจการธนาคาร"
  | "ประกอบธุรกิจจัดสรรที่ดิน"
  | "เจ้าของธุรกิจ"
  | "รับจ้าง"
  | "ทนายความ"
  | "นักกฎหมาย"
  | "ที่ปรึกษากฎหมาย"
  | "ประกอบอาชีพทางกฎหมาย"
  | "ที่ปรึกษากฎหมายและธุรกิจ"
  | "อุตสาหกรรม"
  | "อุตสาหกรรมและพาณิชยกรรม"
  | "พาณิชยกรรม"
  | "พาณิชยกรรมและบริการ"
  | "รับราชการ"
  | "หัตถกรรม";

export const OccupationLists: OccupationLists[] = [
  "ค้าขาย",
  "ประกอบการค้า",
  "ผลิตและค้าขาย",
  "ค้าขายและอุตสาหกรรม",
  "ประกอบกิจการธนาคาร",
  "ประกอบธุรกิจจัดสรรที่ดิน",
  "เจ้าของธุรกิจ",
  "รับจ้าง",
  "ทนายความ",
  "นักกฎหมาย",
  "ที่ปรึกษากฎหมาย",
  "ประกอบอาชีพทางกฎหมาย",
  "ที่ปรึกษากฎหมายและธุรกิจ",
  "อุตสาหกรรม",
  "อุตสาหกรรมและพาณิชยกรรม",
  "พาณิชยกรรม",
  "พาณิชยกรรมและบริการ",
  "รับราชการ",
  "หัตถกรรม",
];
